Q1. List any five functions of the pandas library with execution.

S o there are many functions which are presnet in the pandas library such as given below :-
1:-head
2:-tail
3:-info
4:-describe
5:-apply

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("ds_salaries.csv")

In [5]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [6]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [7]:
df.tail()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [9]:
df.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  3755.000000  3.755000e+03    3755.000000   3755.000000
mean   2022.373635  1.906956e+05  137570.389880     46.271638
std       0.691448  6.716765e+05   63055.625278     48.589050
min    2020.000000  6.000000e+03    5132.000000      0.000000
25%    2022.000000  1.000000e+05   95000.000000      0.000000
50%    2022.000000  1.380000e+05  135000.000000      0.000000
75%    2023.000000  1.800000e+05  175000.000000    100.000000
max    2023.000000  3.040000e+07  450000.000000    100.000000

In [10]:
g=df.groupby('salary')

In [11]:
g

In [13]:
g.mean()

/tmp/ipykernel_70/2978112660.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  g.mean()

          work_year  salary_in_usd  remote_ratio
salary
6000         2022.0         6304.0           0.0
7000         2023.0         7000.0           0.0
7500         2022.0         7500.0          50.0
8000         2021.0         8000.0          75.0
8760         2021.0        10354.0          50.0
...             ...            ...           ...
7000000      2021.0        79188.0          50.0
7500000      2022.0        95386.0          50.0
8500000      2021.0        77364.0          50.0
11000000     2020.5        35997.0          50.0
30400000     2021.0        40038.0         100.0

[815 rows x 3 columns]

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [14]:
data={
'A':[1,2,3,4,5,6],
    'B':[12,4,22,344,21,24],
    'C':[1,56,78,47,15,47]}

In [15]:
df2=pd.DataFrame(data)

In [27]:
df2
yo=[1,3,5,7,9,11]

In [28]:
pd.DataFrame(df,index=yo)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
5,2023,SE,FT,Applied Scientist,222200,USD,222200,US,0,US,L
7,2023,SE,FT,Data Scientist,219000,USD,219000,CA,0,CA,M
9,2023,SE,FT,Data Scientist,147100,USD,147100,US,0,US,M
11,2023,SE,FT,Data Analyst,130000,USD,130000,US,100,US,M

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [40]:
data2={
'values':[10, 20, 30, 40, 50]
    }

In [41]:
df3=pd.DataFrame(data2)

In [42]:
df3

   values
0      10
1      20
2      30
3      40
4      50

In [43]:
len(df3)

5

In [44]:
sum=0
for i in range(len(df3.head(3))):
    sum=df3['values'][i]+sum
print(sum)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [45]:
data2={
'Text':["dasu","vivek","paaji","ajit"]
    }

In [46]:
df4=pd.DataFrame(data2)
df4

    Text
0   dasu
1  vivek
2  paaji
3   ajit

In [48]:
df4["Word_Count"]=0

In [49]:
df4

    Text  Word_Count
0   dasu           0
1  vivek           0
2  paaji           0
3   ajit           0

In [55]:
for i in range(len(df4)):
    df4['Word_Count'][i]=(lambda i:len(df4['Text'][i]))(i)
df4

    Text Word_Count
0   dasu          4
1  vivek          5
2  paaji          5
3   ajit          4

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [62]:
df4.shape

(4, 2)

In [63]:
df4.size

8

Data frame size give the total number of elements present inside the dat frame, where else dataframe.shape gives the total number of rows and columns present inside the dataframe

Q6. Which function of pandas do we use to read an excel file?

we use pd.read_excel() function to read excel file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [4]:
import pandas as pd

In [5]:
data3={
"Email":["Dashrathpatel08@gmail.com","Bhavnachoudhary09@gmail.com","honestyy3@outlook.com","vivekratr@outlook.com"],}

In [7]:
df5=pd.DataFrame(data3)

In [8]:
df5

                         Email
0    Dashrathpatel08@gmail.com
1  Bhavnachoudhary09@gmail.com
2        honestyy3@outlook.com
3        vivekratr@outlook.com

In [35]:
def y(x):
    s=0
    for i in range(len(x)):
        if x[i]=="@":
            break
        else:
            s= str(s)+x[i]
    return s[1:]
            
df5["username"]=0

In [36]:
for i in range(len(df5)):
    df5["username"][i]=y(df5["Email"][i])

/tmp/ipykernel_119/230499885.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5["username"][i]=y(df5["Email"][i])

In [37]:
df5

                         Email           username
0    Dashrathpatel08@gmail.com    Dashrathpatel08
1  Bhavnachoudhary09@gmail.com  Bhavnachoudhary09
2        honestyy3@outlook.com          honestyy3
3        vivekratr@outlook.com          vivekratr

2nd method

In [40]:
y=lambda x : x.split('@')[0]

In [42]:
for i in range(len(df5)):
    df5["username"][i]=y(df5["Email"][i])

In [43]:
df5

                         Email           username
0    Dashrathpatel08@gmail.com    Dashrathpatel08
1  Bhavnachoudhary09@gmail.com  Bhavnachoudhary09
2        honestyy3@outlook.com          honestyy3
3        vivekratr@outlook.com          vivekratr

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [58]:
df6=pd.DataFrame({'A':[3,8,6,2,9],
                        'B':[5,2,9,3,1],
                        'C':[1,7,4,5,2]

})

In [59]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [63]:
def selction_of_dataframe(df6):
    for i in range(len(df6)):
        for j in range(i+1,len(df6)):
            if ((df6['A'][i]+df6['A'][j])>5) and ((df6['B'][i]+df6['B'][j])<10):
                return i,j
            else:
                pass
x,y=selction_of_dataframe(df6)

In [64]:
df6.iloc[[x, y]]

   A  B  C
0  3  5  1
1  8  2  7

sorry in this above i have done by addidng the numbers of i and j by iterating

In [65]:
import pandas as pd

def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

# Example usage:
data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}

df = pd.DataFrame(data)
selected_df = select_rows(df)
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [66]:
data = {'Values': [3, 8, 6, 2, 9],
        }

In [67]:
df=pd.DataFrame(data)

In [68]:
df

   Values
0       3
1       8
2       6
3       2
4       9

In [69]:
df.sum()

Values    28
dtype: int64

In [70]:
df.mean()

Values    5.6
dtype: float64

In [75]:
len(df)//2

2

In [77]:
df.median()

Values    6.0
dtype: float64

In [78]:
df.std()

Values    3.04959
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [81]:

def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

# Example usage:
data = {'Date': ['2023-06-01', '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05', '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09', '2023-06-10'],
        'Sales': [10, 15, 12, 18, 20, 17, 25, 22, 19, 30]}

df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime type
df = df.sort_values('Date').reset_index(drop=True)  # Sort DataFrame by 'Date' column

df = calculate_moving_average(df)
print(df)

        Date  Sales  MovingAverage
0 2023-06-01     10      10.000000
1 2023-06-02     15      12.500000
2 2023-06-03     12      12.333333
3 2023-06-04     18      13.750000
4 2023-06-05     20      15.000000
5 2023-06-06     17      15.333333
6 2023-06-07     25      16.714286
7 2023-06-08     22      18.428571
8 2023-06-09     19      19.000000
9 2023-06-10     30      21.571429

In [82]:
df['Sales'].rolling(window=7,min_periods=1).max()  just an example

0    10.0
1    15.0
2    15.0
3    18.0
4    20.0
5    20.0
6    25.0
7    25.0
8    25.0
9    30.0
Name: Sales, dtype: float64

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [92]:

date1={
'Date':["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]
}
df2=pd.DataFrame(date1)
date= pd.to_datetime(df2['Date']) 
df2

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [96]:
def weekday(df2,date):
    df['weekday']=date.dt.day_name()
weekday(df2,date)
df.dropna()

         Date  Sales    weekday
0  2023-06-01     10     Sunday
1  2023-06-02     15     Monday
2  2023-06-03     12    Tuesday
3  2023-06-04     18  Wednesday
4  2023-06-05     20   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [97]:

def select_rows_by_date_range(df, start_date, end_date):
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df.loc[mask]
    return selected_rows

# Example usage:
data = {'Date': ['2022-12-31', '2023-01-01', '2023-01-15', '2023-01-31', '2023-02-10'],
        'Value': [10, 20, 30, 40, 50]}

df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])

start_date = pd.to_datetime('2023-01-01')
end_date = pd.to_datetime('2023-01-31')

selected_df = select_rows_by_date_range(df, start_date, end_date)
print(selected_df)

        Date  Value
1 2023-01-01     20
2 2023-01-15     30
3 2023-01-31     40

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [99]:
# pandas library
import pandas as pd